Add color-coded Kafka business flow
